In [5]:
#Answer-1
import pandas as pd

data = pd.Series([4,8,15,16,23,42],index = ['a','b','c','d','e','f'])
data

a     4
b     8
c    15
d    16
e    23
f    42
dtype: int64

In [17]:
#Answer-2
l = ["vishal","anjali","pankaj","Ansh","sorraya","tanvi","Rakesh","sonu","pawan","amit","kamran"]
data1= pd.Series(l)
data1

0      vishal
1      anjali
2      pankaj
3        Ansh
4     sorraya
5       tanvi
6      Rakesh
7        sonu
8       pawan
9        amit
10     kamran
dtype: object

In [18]:
#Answer-3
data3 = pd.DataFrame({"Name":["Alice","Bob","Claire"],
                     "Age":[25,30,27],
                     "Gender":["Female","Male","Female"] })
data3

     Name  Age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

In [21]:
#Answer-4
# Pandas DataFrame is a widely used data structure which works with a two-dimensional array with labeled axes (rows and columns).
# DataFrame is defined as a standard way to store data that has two different indexes, i.e., row index and column index.
# Series is defined as a one-dimensional array that is capable of storing various data types. The row labels of series are called the index. We can easily convert the list, tuple, and dictionary into series using "series' method.
d1 = pd.Series([1,2,3,5,6])
d1

0    1
1    2
2    3
3    5
4    6
dtype: int64

In [22]:
d2 = pd.DataFrame({"Name":["vishal","ram","aman"],
                  "subject":["math","science","hindi"]
                  })
d2

     Name  subject
0  vishal     math
1     ram  science
2    aman    hindi

In [28]:
#Answer-5
df3 = pd.DataFrame({"Name":["vishal","ram","rakesh","raju"],"subject":["hindi","english","math","social"],"score":[90,80,70,45]})
df3

     Name  subject  score
0  vishal    hindi     90
1     ram  english     80
2  rakesh     math     70
3    raju   social     45

In [29]:
df3.index = [1,2,3,4]
df3

     Name  subject  score
1  vishal    hindi     90
2     ram  english     80
3  rakesh     math     70
4    raju   social     45

In [35]:
df3.head(2)

     Name  subject  score Grade
1  vishal    hindi     90     A
2     ram  english     80     B

In [32]:
def g(x):
    if x<50:
        return "C"
    elif x>=60 and x<85:
        return "B"
    else:
        return "A"
df3["Grade"] = df3["score"].apply(g) 
df3

     Name  subject  score Grade
1  vishal    hindi     90     A
2     ram  english     80     B
3  rakesh     math     70     B
4    raju   social     45     C

In [34]:
df3.tail(2)

     Name subject  score Grade
3  rakesh    math     70     B
4    raju  social     45     C

In [36]:
#Answer-6
# All pandas data structures are value-mutable (the values they contain can be altered) but not always size-mutable.

# Series - Size Immutable, Values Mutable
# DataFrame - Size Mutable, Values Mutable
# Panel - Size Mutable, Values Mutable

In [42]:
# Answer-7
s1 = pd.Series(["wake_up","reach_stadium","runing_time"])
s2 = pd.Series([5.35,5.45,5.55])
print(type(s1),type(s2))

<class 'pandas.core.series.Series'> <class 'pandas.core.series.Series'>

In [43]:
pd.DataFrame([s1,s2])

         0              1            2
0  wake_up  reach_stadium  runing_time
1     5.35           5.45         5.55